In [1]:
import pandas as pd
import re
import matplotlib.pyplot as plt
import random
import seaborn as sns

%matplotlib inline

In [2]:
df = pd.read_csv('../inputs/test.csv')

In [3]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
df.Fare.describe()

count    417.000000
mean      35.627188
std       55.907576
min        0.000000
25%        7.895800
50%       14.454200
75%       31.500000
max      512.329200
Name: Fare, dtype: float64

In [5]:
df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [6]:
def courtesy(value):
    court = {
        r"Mr\.": "Mr",
        r"Mr\s": "Mr",
        r"Mrs\.": "Mrs",
        r"Mrs\s": "Mrs",
        r"Ms\.": "Mrs",
        r"Miss\.": "Miss",
        r"Master\.": "Master",
        r"Dr\.": "Dr",
        r"Rev\.": "Rev",
        r"Col\.": "Col",
        #r"Capt\.": "Capt",
        #r"Major\.": "Major"
    }
    for k,v in court.items():
        if re.search(k, value):
            return v
    else:
        return "Other"

In [7]:
df['Court'] = df.Name.apply(lambda x: courtesy(str(x)))

In [8]:
df.Court.value_counts(dropna=False)

Mr        240
Miss       78
Mrs        73
Master     21
Col         2
Rev         2
Dr          1
Other       1
Name: Court, dtype: int64

In [7]:
df.loc[df.Court=='Other']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Court
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C,Other
369,370,1,1,"Aubart, Mme. Leontine Pauline",female,24.0,0,0,PC 17477,69.3000,B35,C,Other
641,642,1,1,"Sagesser, Mlle. Emma",female,24.0,0,0,PC 17477,69.3000,B35,C,Other
759,760,1,1,"Rothes, the Countess. of (Lucy Noel Martha Dye...",female,33.0,0,0,110152,86.5000,B77,S,Other
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S,Other

In [8]:
df.Court.value_counts(dropna=False)

Mr        518
Miss      180
Mrs       130
Master     40
Dr          7
Rev         6
Other       5
Col         2
Major       2
Capt        1
Name: Court, dtype: int64

In [9]:
df.loc[df.Age.isna()].Court.value_counts()

Mr        119
Miss       36
Mrs        17
Master      4
Dr          1
Name: Court, dtype: int64

In [10]:
df.loc[df.Court=="Mr"].Age.describe()

count    399.000000
mean      32.409774
std       12.720098
min       11.000000
25%       23.000000
50%       30.000000
75%       39.000000
max       80.000000
Name: Age, dtype: float64

In [11]:
old_index = df.loc[(df.Court=='Mr')&(df.Age.isna())].index

In [12]:
lst_court = list(df.Court.unique())

for court in lst_court:
    descr = df.loc[df.Court==court].Age.describe()

    for indx, row in df.loc[(df.Court==court)&(df.Age.isna())].iterrows():
        rnd = random.randint(0,100)
        if rnd < 25:
            df.loc[indx, 'Age']=random.randint(int(descr['25%']-descr['std']), int(descr['25%']+descr['std']))
        elif 25 <= rnd <= 50:
            df.loc[indx, 'Age']=random.randint(int(descr['50%']-descr['std']), int(descr['50%']+descr['std']))
        else:
            df.loc[indx, 'Age']=random.randint(int(descr['75%']-descr['std']), int(descr['75%']+descr['std']))

In [13]:
df.iloc[old_index]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Court
5,6,0,3,"Moran, Mr. James",male,42.0,0,0,330877,8.4583,NaN,Q,Mr
17,18,1,2,"Williams, Mr. Charles Eugene",male,47.0,0,0,244373,13.0000,NaN,S,Mr
26,27,0,3,"Emir, Mr. Farred Chehab",male,32.0,0,0,2631,7.2250,NaN,C,Mr
29,30,0,3,"Todoroff, Mr. Lalio",male,32.0,0,0,349216,7.8958,NaN,S,Mr
36,37,1,3,"Mamee, Mr. Hanna",male,31.0,0,0,2677,7.2292,NaN,C,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...
839,840,1,1,"Marechal, Mr. Pierre",male,34.0,0,0,11774,29.7000,C47,C,Mr
846,847,0,3,"Sage, Mr. Douglas Bullen",male,22.0,8,2,CA. 2343,69.5500,NaN,S,Mr
859,860,0,3,"Razi, Mr. Raihed",male,38.0,0,0,2629,7.2292,NaN,C,Mr
868,869,0,3,"van Melkebeke, Mr. Philemon",male,36.0,0,0,345777,9.5000,NaN,S,Mr
878,879,0,3,"Laleff, Mr. Kristo",male,38.0,0,0,349217,7.8958,NaN,S,Mr

In [14]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Court            0
dtype: int64

In [15]:
df.Embarked.value_counts(dropna=False,normalize=True)

S      0.722783
C      0.188552
Q      0.086420
NaN    0.002245
Name: Embarked, dtype: float64

In [17]:
df.Embarked.fillna('S', inplace=True)
df.Embarked.value_counts(dropna=False,normalize=True)

S    0.725028
C    0.188552
Q    0.086420
Name: Embarked, dtype: float64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
 12  Court        891 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 90.6+ KB

In [23]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,Court
0,1,0,3,male,22.0,1,0,7.2500,S,Mr
1,2,1,1,female,38.0,1,0,71.2833,C,Mrs
2,3,1,3,female,26.0,0,0,7.9250,S,Miss
3,4,1,1,female,35.0,1,0,53.1000,S,Mrs
4,5,0,3,male,35.0,0,0,8.0500,S,Mr

In [22]:
df.drop(['Name', 'Ticket', 'Cabin'], axis=1, inplace=True)

In [30]:
dummy = pd.get_dummies(data=df, columns=['Sex', 'Embarked', 'Court'])

In [32]:
dummy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 22 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PassengerId   891 non-null    int64
 1   Survived      891 non-null    int64
 2   Pclass        891 non-null    int64
 3   Age           891 non-null    float64
 4   SibSp         891 non-null    int64
 5   Parch         891 non-null    int64
 6   Fare          891 non-null    float64
 7   Sex_female    891 non-null    uint8
 8   Sex_male      891 non-null    uint8
 9   Embarked_C    891 non-null    uint8
 10  Embarked_Q    891 non-null    uint8
 11  Embarked_S    891 non-null    uint8
 12  Court_Capt    891 non-null    uint8
 13  Court_Col     891 non-null    uint8
 14  Court_Dr      891 non-null    uint8
 15  Court_Major   891 non-null    uint8
 16  Court_Master  891 non-null    uint8
 17  Court_Miss    891 non-null    uint8
 18  Court_Mr      891 non-null    uint8
 19  Court_Mrs     891 non-null    uint8
 20  Court_Other   891 non-null    uint8
 21  Court_Rev     891 non-null    uint8
dtypes: float64(2), int64(5), uint8(15)
memory usage: 61.9 KB